In [2]:
import pandas as pd

In [12]:
data = {"Sex":["m","f","m","f","f"], "symbol":[1,2,3,4,5]}
df= pd.DataFrame(data)

In [4]:
df.head()

  Sex  symbol
0   m       1
1   f       2
2   m       3
3   f       4
4   f       5

In [9]:
[df.dtypes=="O"]

[Sex        True
 symbol    False
 dtype: bool]

In [13]:
df1= df[df.dtypes[df.dtypes=="O"].index]

In [14]:
df1

  Sex
0   m
1   f
2   m
3   f
4   f

In [15]:
pd.get_dummies(df1)

   Sex_f  Sex_m
0      0      1
1      1      0
2      0      1
3      1      0
4      1      0